driver-tests/bpelse/assign/AssignJbi/test/echoShortDataType_Invoke/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://stc.com/echoShortDataType">
<SOAP-ENV:Header/>
<SOAP-ENV:Body>
  <item xmlns="http://stc.com/echoShortDataType">
    <string>1</string>
    <normalizedString>1</normalizedString>
    <token>1</token>
    <base64Binary>1</base64Binary>
    <hexBinary>1</hexBinary>
    <integer>1</integer>
    <positiveInteger>1</positiveInteger>
    <negativeInteger>1</negativeInteger>
    <nonNegativeInteger>1</nonNegativeInteger>
    <nonPositiveInteger>1</nonPositiveInteger>
    <long>1</long>
    <unsignedLong>1</unsignedLong>
    <int>1</int>
    <unsignedInt>1</unsignedInt>
    <short>1</short>
    <unsignedShort>1</unsignedShort>
    <byte>1</byte>
    <unsignedByte>1</unsignedByte>
    <decimal>1</decimal>
    <float>1</float>
    <double>1</double>
    <boolean>1</boolean>
    <duration>1</duration>
    <dateTime>1</dateTime>
    <date>1</date>
    <time>1</time>
    <gYear>1</gYear>
    <gYearMonth>1</gYearMonth>
    <gMonth>1</gMonth>
    <gMonthDay>1</gMonthDay>
    <gDay>1</gDay>
    <Name>1</Name>
    <QName>1</QName>
    <NCName>1</NCName>
    <anyURI>1</anyURI>
    <language>1</language>
    <ID>1</ID>
    <IDREF>1</IDREF>
    <IDREFS>1</IDREFS>
    <ENTITY>1</ENTITY>
    <ENTITIES>1</ENTITIES>
    <NMTOKEN>1</NMTOKEN>
    <NMTOKENS>1</NMTOKENS>
  </item>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
